app/Controllers/AdminController.php

   public function users()
{
    $usersModel = new \App\Models\Users_model();

    // Fetch all users from DB
    $allUsers = $usersModel->findAll();
---
SELECT *
FROM `users`

public function getUser($id)
{
    $usersModel = new \App\Models\Users_model();
    $user = $usersModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'