app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = '202310393@fit.edu.ph'
 LIMIT 1
---
    public function attempt()
    {
        $request = service('request');
        $email = trim($request->getPost('email'));
        $password = $request->getPost('password');

        $usersModel = new \App\Models\Users_model();

        // Check if email exists in database
        $user = $usersModel->where('email', $email)->first();