app/Controllers/BorrowController.php

SELECT `equipment_name`
FROM `equipment`
WHERE `available` = 1
GROUP BY `equipment_name`
---
    public function index()
    {
        $equipmentModel = new Equipment_model();

        // Get distinct equipment names where available
        $builder = $equipmentModel->builder();
        $builder->select('equipment_name');
        $builder->where('available', 1);
        $builder->groupBy('equipment_name');
        $distinctEquipment = $builder->get()->getResultArray();