app/Controllers/EquipmentController.php

SELECT `equipment_name`, `equipment_type`, `status`, COUNT(*) as total_qty, SUM(available) as available_qty, MAX(image) as image
FROM `equipment`
GROUP BY `equipment_name`, `equipment_type`, `status`
---
    public function index()
    {
        $equipmentModel = new Equipment_model();

        // Get all equipment records
        $data['equipment'] = $equipmentModel
            ->select('equipment_id, equipment_name, equipment_type, available, status, image, description')
            ->findAll();