app/Controllers/Products.php

            'image' => $imageName,
        ];

        $productModel->update($id, $data);
---
UPDATE `products` SET `product_name` = 'Leche Flan', `description` = 'Smooth and creamy caramel custard dessert. Super yummy dessert', `price` = '180.00', `category` = 'Beverages', `image` = '1760083414_fe324544e48ee9bae8d5.jpg'
WHERE `products`.`id` IN ('7')