app/Controllers/ReturnController.php

    public function index()
    {
        $equipmentModel = new Equipment_model();

        // Get distinct equipment names that are currently borrowed (status = 'borrowed')
        $borrowedModel = new Borrowed_model();
        $builder = $borrowedModel->builder();
        $builder->select('equipment.equipment_name')
                ->join('equipment', 'borrowed_items.equipment_id = equipment.equipment_id')
                ->where('borrowed_items.status', 'borrowed')
                ->groupBy('equipment.equipment_name');
        $borrowedEquipment = $builder->get()->getResultArray();
---
SELECT `equipment`.`equipment_name`
FROM `borrowed_items`
JOIN `equipment` ON `borrowed_items`.`equipment_id` = `equipment`.`equipment_id`
WHERE `borrowed_items`.`status` = 'borrowed'
GROUP BY `equipment`.`equipment_name`